; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v9 ?v4)
             (pred_7 ?v5 ?v8)
             (pred_4 ?v9 ?v8)
             (pred_9 ?v6 ?v9 )
	     (pred_10 ?v9)
             (pred_12 ?v12)
             (pred_3 ?v5)
             (pred_5 ?v8)
             (pred_1 ?v9)
             (pred_6 ?v5)
             (pred_11 ?v9)
             (pred_2 ))



(:action op_4
:parameters (?v7 ?v2 ?v3 ?v10)
:precondition (and (pred_12 ?v7) (pred_12 ?v2) (pred_3 ?v3) (pred_5 ?v10)
          (pred_8 ?v7 ?v2) (pred_7 ?v3 ?v10)
                   (pred_4 ?v2 ?v10) (pred_10 ?v7) 
                   (pred_1 ?v2) (pred_6 ?v3))
:effect (and  (pred_11 ?v2) (not (pred_1 ?v2))))


(:action op_3
:parameters (?v7 ?v11)
:precondition (and (pred_12 ?v7) (pred_12 ?v11)
               (pred_10 ?v7) (pred_8 ?v7 ?v11) (pred_11 ?v11))
:effect (and (pred_10 ?v11) (not (pred_10 ?v7))))

(:action op_5
:parameters (?v7 ?v3)
:precondition (and (pred_12 ?v7) (pred_3 ?v3) 
                  (pred_10 ?v7) (pred_9 ?v3 ?v7) (pred_2 ))
:effect (and (pred_6 ?v3)
   (not (pred_9 ?v3 ?v7)) (not (pred_2 ))))


(:action op_2
:parameters (?v7 ?v13 ?v1)
:precondition (and (pred_12 ?v7) (pred_3 ?v13) (pred_3 ?v1)
                  (pred_10 ?v7) (pred_6 ?v1) (pred_9 ?v13 ?v7))
:effect (and (pred_6 ?v13) (pred_9 ?v1 ?v7)
        (not (pred_6 ?v1)) (not (pred_9 ?v13 ?v7))))

(:action op_1
:parameters (?v7 ?v3)
:precondition (and (pred_12 ?v7) (pred_3 ?v3) 
                  (pred_10 ?v7) (pred_6 ?v3))
:effect (and (pred_2 ) (pred_9 ?v3 ?v7) (not (pred_6 ?v3)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_31 obj_06 obj_04 obj_10 obj_13 obj_26 obj_03 obj_15 obj_30 obj_08 obj_07 obj_25 obj_21 obj_12 obj_01 obj_09 obj_29 obj_18 obj_14 obj_24 obj_11 obj_22 obj_27 obj_28 obj_05
    obj_16 obj_23 obj_20
    obj_19 obj_17 obj_02
    )

    (:init
       (pred_2)

       (pred_12 obj_31)
       (pred_12 obj_06)
       (pred_12 obj_04)
       (pred_12 obj_10)
       (pred_12 obj_13)
       (pred_12 obj_26)
       (pred_12 obj_03)
       (pred_12 obj_15)
       (pred_12 obj_30)
       (pred_12 obj_08)
       (pred_12 obj_07)
       (pred_12 obj_25)
       (pred_12 obj_21)
       (pred_12 obj_12)
       (pred_12 obj_01)
       (pred_12 obj_09)
       (pred_12 obj_29)
       (pred_12 obj_18)
       (pred_12 obj_14)
       (pred_12 obj_24)
       (pred_12 obj_11)
       (pred_12 obj_22)
       (pred_12 obj_27)
       (pred_12 obj_28)
       (pred_12 obj_05)
       (pred_5 obj_16)
       (pred_5 obj_23)
       (pred_5 obj_20)
       (pred_3 obj_19)
       (pred_3 obj_17)
       (pred_3 obj_02)

       (pred_8 obj_31 obj_26)
       (pred_8 obj_31 obj_06)
       (pred_8 obj_06 obj_03)
       (pred_8 obj_06 obj_04)
       (pred_8 obj_06 obj_31)
       (pred_8 obj_04 obj_15)
       (pred_8 obj_04 obj_10)
       (pred_8 obj_04 obj_06)
       (pred_8 obj_10 obj_30)
       (pred_8 obj_10 obj_13)
       (pred_8 obj_10 obj_04)
       (pred_8 obj_13 obj_08)
       (pred_8 obj_13 obj_10)
       (pred_8 obj_26 obj_07)
       (pred_8 obj_26 obj_03)
       (pred_8 obj_26 obj_31)
       (pred_8 obj_03 obj_25)
       (pred_8 obj_03 obj_15)
       (pred_8 obj_03 obj_06)
       (pred_8 obj_03 obj_26)
       (pred_8 obj_15 obj_21)
       (pred_8 obj_15 obj_30)
       (pred_8 obj_15 obj_04)
       (pred_8 obj_15 obj_03)
       (pred_8 obj_30 obj_12)
       (pred_8 obj_30 obj_08)
       (pred_8 obj_30 obj_10)
       (pred_8 obj_30 obj_15)
       (pred_8 obj_08 obj_01)
       (pred_8 obj_08 obj_13)
       (pred_8 obj_08 obj_30)
       (pred_8 obj_07 obj_09)
       (pred_8 obj_07 obj_25)
       (pred_8 obj_07 obj_26)
       (pred_8 obj_25 obj_29)
       (pred_8 obj_25 obj_21)
       (pred_8 obj_25 obj_03)
       (pred_8 obj_25 obj_07)
       (pred_8 obj_21 obj_18)
       (pred_8 obj_21 obj_12)
       (pred_8 obj_21 obj_15)
       (pred_8 obj_21 obj_25)
       (pred_8 obj_12 obj_14)
       (pred_8 obj_12 obj_01)
       (pred_8 obj_12 obj_30)
       (pred_8 obj_12 obj_21)
       (pred_8 obj_01 obj_24)
       (pred_8 obj_01 obj_08)
       (pred_8 obj_01 obj_12)
       (pred_8 obj_09 obj_11)
       (pred_8 obj_09 obj_29)
       (pred_8 obj_09 obj_07)
       (pred_8 obj_29 obj_22)
       (pred_8 obj_29 obj_18)
       (pred_8 obj_29 obj_25)
       (pred_8 obj_29 obj_09)
       (pred_8 obj_18 obj_27)
       (pred_8 obj_18 obj_14)
       (pred_8 obj_18 obj_21)
       (pred_8 obj_18 obj_29)
       (pred_8 obj_14 obj_28)
       (pred_8 obj_14 obj_24)
       (pred_8 obj_14 obj_12)
       (pred_8 obj_14 obj_18)
       (pred_8 obj_24 obj_05)
       (pred_8 obj_24 obj_01)
       (pred_8 obj_24 obj_14)
       (pred_8 obj_11 obj_22)
       (pred_8 obj_11 obj_09)
       (pred_8 obj_22 obj_27)
       (pred_8 obj_22 obj_29)
       (pred_8 obj_22 obj_11)
       (pred_8 obj_27 obj_28)
       (pred_8 obj_27 obj_18)
       (pred_8 obj_27 obj_22)
       (pred_8 obj_28 obj_05)
       (pred_8 obj_28 obj_14)
       (pred_8 obj_28 obj_27)
       (pred_8 obj_05 obj_24)
       (pred_8 obj_05 obj_28)
       (pred_1 obj_13)
       (pred_1 obj_10)
       (pred_1 obj_12)
       (pred_4  obj_13 obj_16)
       (pred_4  obj_10 obj_23)
       (pred_4  obj_12 obj_20)
       (pred_11 obj_31)
       (pred_11 obj_06)
       (pred_11 obj_04)
       (pred_11 obj_26)
       (pred_11 obj_03)
       (pred_11 obj_15)
       (pred_11 obj_30)
       (pred_11 obj_08)
       (pred_11 obj_07)
       (pred_11 obj_25)
       (pred_11 obj_21)
       (pred_11 obj_01)
       (pred_11 obj_09)
       (pred_11 obj_29)
       (pred_11 obj_18)
       (pred_11 obj_14)
       (pred_11 obj_24)
       (pred_11 obj_11)
       (pred_11 obj_22)
       (pred_11 obj_27)
       (pred_11 obj_28)
       (pred_11 obj_05)

       (pred_7  obj_19 obj_16)
       (pred_7  obj_17 obj_23)
       (pred_7  obj_02 obj_20)
       (pred_9 obj_19 obj_09)
       (pred_9 obj_17 obj_15)
       (pred_9 obj_02 obj_07)
       (pred_10 obj_22)
    )

    (:goal (and
       (pred_9 obj_19 obj_13)
       (pred_9 obj_17 obj_22)
    ))
(:constraints
  (always (not (pred_10 obj_29)))
)
)

; plan
1. (op_3 obj_22 obj_11)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_11)
   goals met: 0 of 2
2. (op_3 obj_11 obj_09)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_09)
   goals met: 0 of 2
3. (op_5 obj_09 obj_19)
   deleted: (pred_9 obj_19 obj_09) (pred_2)
   added: (pred_6 obj_19)
   goals met: 0 of 2
4. (op_3 obj_09 obj_07)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_07)
   goals met: 0 of 2
5. (op_3 obj_07 obj_25)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_25)
   goals met: 0 of 2
6. (op_3 obj_25 obj_03)
   deleted: (pred_10 obj_25)
   added: (pred_10 obj_03)
   goals met: 0 of 2
7. (op_3 obj_03 obj_15)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_15)
   goals met: 0 of 2
8. (op_3 obj_15 obj_30)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_30)
   goals met: 0 of 2
9. (op_3 obj_30 obj_08)
   deleted: (pred_10 obj_30)
   added: (pred_10 obj_08)
   goals met: 0 of 2
10. (op_4 obj_08 obj_13 obj_19 obj_16)
   deleted: (pred_1 obj_13)
   added: (pred_11 obj_13)
   goals met: 0 of 2
11. (op_3 obj_08 obj_13)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_13)
   goals met: 0 of 2
12. (op_1 obj_13 obj_19)
   deleted: (pred_6 obj_19)
   added: (pred_2) (pred_9 obj_19 obj_13)
   goals met: 1 of 2
13. (op_3 obj_13 obj_08)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_08)
   goals met: 1 of 2
14. (op_3 obj_08 obj_30)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_30)
   goals met: 1 of 2
15. (op_3 obj_30 obj_15)
   deleted: (pred_10 obj_30)
   added: (pred_10 obj_15)
   goals met: 1 of 2
16. (op_5 obj_15 obj_17)
   deleted: (pred_9 obj_17 obj_15) (pred_2)
   added: (pred_6 obj_17)
   goals met: 1 of 2
17. (op_3 obj_15 obj_21)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_21)
   goals met: 1 of 2
18. (op_3 obj_21 obj_18)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_18)
   goals met: 1 of 2
19. (op_3 obj_18 obj_27)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_27)
   goals met: 1 of 2
20. (op_3 obj_27 obj_22)
   deleted: (pred_10 obj_27)
   added: (pred_10 obj_22)
   goals met: 1 of 2
21. (op_1 obj_22 obj_17)
   deleted: (pred_6 obj_17)
   added: (pred_2) (pred_9 obj_17 obj_22)
   goals met: 2 of 2
